import PrivacyTextItem from 'components/modules/Privacy/PrivacyTextItem';
import PrivacyTitleItem from 'components/modules/Privacy/PrivacyTitleItem';
import React from 'react';
import styles from '../../components/modules/Privacy/privacy.module.scss';

export default function PrivacyPage() {
  return (
    <div className={styles.privacy}>
      <h1 className={styles.privacy__title}>ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ</h1>
      <div className={styles.privacy__block}>
        <PrivacyTextItem text='Дякуємо за відвідування веб-сайту Team Challenge Library (TCL).' />
        <PrivacyTextItem
          text="Ми визнаємо важливість
        захисту вашої конфіденційності і зобов'язуємося захищати інформацію, яку ви нам надаєте."
        />

        <PrivacyTitleItem text='Збір і використання інформації' />
        <PrivacyTextItem
          text='Надаючи свої персональні дані на сайті TCL, ви надаєте добровільну згоду на обробку,
        використання своїх персональних даних, а також вчинення інших дій, передбачених Законом
        України «Про захист персональних даних». Надана вами інформація є конфіденційною і не
        передається третім особам, крім випадків, передбачених законодавством.'
        />

        <PrivacyTextItem
          text="Ми збираємо персональну інформацію, яку ви нам надаєте, таку як ім'я, контактні дані та іншу
        необхідну інформацію, яка допомагає нам забезпечувати кращий сервіс. Ця інформація
        використовується виключно для внутрішніх потреб нашого магазину, з метою обробки замовлень і
        забезпечення ефективного обслуговування клієнтів."
        />
        <PrivacyTextItem
          text='бір ваших персональних даних здійснюється при реєстрації на сайті, а також при подальшому
        використанні ресурсу.'
        />

        <PrivacyTitleItem text='Форми та інтерактивність' />
        <PrivacyTextItem
          text='Ваша особиста інформація збирається за допомогою контактної форми веб-сайту. Ми
        використовуємо зібрану таким чином інформацію для наступних цілей: відстеження замовлень,
        відповіді на вхідні повідолмення від користувачів сайту.'
        />

        <PrivacyTitleItem text='Захист і збереження даних' />
        <PrivacyTextItem
          text='Ми прикладаємо всі можливі зусилля для забезпечення безпеки вашої особистої інформації під
        час її передачі, обробки і зберігання. Ми не передаємо ваші дані третім особам без вашого
        згоди, за винятком випадків, передбачених законодавством.'
        />

        <PrivacyTitleItem text='Використання файлів cookies' />
        <PrivacyTextItem
          text='Наш веб-сайт може використовувати файли cookies для поліпшення користувацького досвіду і
        збору аналітичних даних. Ви можете налаштувати ваш браузер таким чином, щоб відхиляти всі
        cookies або попереджати про їхнє використання.'
        />

        <PrivacyTitleItem text='Зміни в політиці конфіденційності' />
        <PrivacyTextItem
          text='Ми можемо оновлювати цю політику періодично. Якщо ми внесемо суттєві зміни, ми повідомимо
        вас шляхом публікації оновленої версії нашої веб-сторінки.'
        />

        <PrivacyTitleItem text='Контактна інформація' />
        <PrivacyTextItem
          text="Якщо у вас виникнуть питання щодо цієї політики конфіденційності, будь ласка, зв'яжіться з
        нами за адресою info@tcl.ua."
        />
      </div>
    </div>
  );
}
