export const EXCLUDED_DOMAINS = ['mail.ru', 'yandex.ru'];

export const errorMessage = {
  FIRST_NAME: 'Будь ласка, перевірте правильність введення ім’я',
  LAST_NAME: 'Будь ласка, перевірте правильність введення прізвища',
  PHONE_NUMBER: 'Будь ласка, перевірте правильність введення мобільного номера ',
  EMAIL: 'Будь ласка, перевірте правильність введення пошти',
  PASSWORD: {
    COMMON: 'Будь ласка, перевірте правильність введення пароля',
    STRENGTH: {
      WEAK: 'Пароль слабкий',
      MEDIUM: 'Пароль хороший',
      STRONG: 'Пароль надійний',
    },
  },
  CONFIRM_PASSWORD: 'Будь ласка, перевірте правильність введення паролю. Паролі мають співпадати',
  PHONE_OR_EMAIL: 'Будь ласка, перевірте правильність введення пошти, телефону, та пароля',
};
