export const EXCLUDED_DOMAINS = ['mail.ru', 'yandex.ru'];

export const errorMessage = {
  FIRST_NAME: 'Будь ласка, перевірте правильність введення ім’я',
  LAST_NAME: 'Будь ласка, перевірте правильність введення прізвища',
  PHONE_NUMBER: 'Будь ласка, перевірте правильність введення мобільного номера ',
  EMAIL: 'Будь ласка, перевірте правильність введення пошти',
  PASSWORD: {
    COMMON: 'Будь ласка, перевірте правильність введення пароля',
    STRENGTH: {
      WEAK: 'Пароль слабкий',
      MEDIUM: 'Пароль хороший',
      STRONG: 'Пароль надійний',
    },
  },
  CONFIRM_PASSWORD: 'Будь ласка, перевірте правильність введення паролю. Паролі мають співпадати',
  PHONE_OR_EMAIL: 'Будь ласка, перевірте правильність введення пошти або телефону',
  COMMENT: 'Максимум 500 символів',
};

export const errorFirstNameTips = [
  'Ви можете використовувати лише кирилицю та латиницю.',
  'Ви можете використовувати великі та малі літери.',
  'Довжина імені має бути від 2 до 50 символів.',
];

export const errorLastNameTips = [
  'Ви можете використовувати лише кирилицю та латиницю.',
  'Ви можете використовувати великі та малі літери.',
  'Довжина імені має бути від 2 до 50 символів.',
];

export const errorPhoneNumberTips = [
  'Ви можете використовувати лише арабські цифри та «+».',
  'Довжина мобільного номера має бути 13 символів, включаючи «+».',
];

export const errorEmailTips = [
  "Ви можете використовувати лише арабські цифри, латиницю та наступні символи ~ ! $ % ^ & * _ = + } { ' ? - @.",
  'Ви можете використовувати великі та малі літери.',
  'Пошта має містити “@”.',
  "Пошта повинна мати будь-який діючий домейн окрім “mail.ru”, “yandex.ru” та інших доменів, пов'язаних з росією.",
];

export const errorPasswordTips = [
  "Ви можете використовувати лише арабські цифри, латиницю та наступні символи ~ ! $ % ^ & * _ = + } { ' ? -",
  'Ви можете використовувати великі та малі літери.',
  'Довжина пароля має бути від 8 до 30 символів.',
  'Використовуйте комбінацію великих та малих літер, арабських цифр та спеціальних символів для створення більш надійного пароля.',
  'Перевірте чи ввімкнено CapsLock.',
];

export const errorTextTips = [
  'Ви можете використовувати лише українську мову',
  'Ви можете використовувати великі та малі літери.',
];
